<a href="https://colab.research.google.com/github/HwangHanJae/datascience-basic-tect/blob/main/pandas_10minutes_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Tutorial
- 10 minutes to pandas

# 라이브러리 로드

In [1]:
import numpy as np
import pandas as pd

# 객체 생성

value의 리스트를 전달하여 Series 타입을 생성하고 pandas의 기본 인덱스를 적용합니다.

In [2]:
#Input
s = pd.Series([1,3,5, np.nan, 6,8])
#Output
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datatime 타입과 레이블이있는 column과 Numpy array를 전달하여 Dataframe을 생성합니다.

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-06  0.407420  0.588710  0.357765  0.452582

Series 타입처럼 변환할수 있는 객체의 dict 타입을 전달하여 DataFrame을 생성합니다.

In [5]:
df2 = pd.DataFrame(
    {"A" : 1.0,
    "B" : pd.Timestamp("20130102"),
    "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
    "D" : np.array([3] *4, dtype="int32"),
    "E" : pd.Categorical(["test","train","test","train"]),
    "F" : 'foo',}
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Dataframe의 columns 들은 다른 dtypes를 가지고 있습니다.

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 데이터 관찰

데이터 프레임의 상단, 하단을 보는 방법입니다.

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262

In [8]:
df.tail()

                   A         B         C         D
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-06  0.407420  0.588710  0.357765  0.452582

index, columns를 표현합니다.

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy()는 NumPy 표현을 제공합니다.

In [11]:
df

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-06  0.407420  0.588710  0.357765  0.452582

In [12]:
df.to_numpy()

array([[ 0.4742611 ,  0.42231312,  1.73404952,  0.75453398],
       [ 0.72357115,  0.38393526, -0.47723887, -0.95527725],
       [-0.13264356, -1.23882965, -0.22117761, -0.04332907],
       [-0.81833986, -2.49043052, -1.03772188, -0.40191209],
       [ 0.34123576, -1.11003641,  0.03074035, -0.42326163],
       [ 0.40741987,  0.58870971,  0.35776527,  0.45258203]])

In [13]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

DataFrame.to_numpy()는 index와 columns를 포함하지 않습니다.

Data를 T(transpose)합니다.

In [15]:
df

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-06  0.407420  0.588710  0.357765  0.452582

In [16]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.474261    0.723571   -0.132644   -0.818340    0.341236    0.407420
B    0.422313    0.383935   -1.238830   -2.490431   -1.110036    0.588710
C    1.734050   -0.477239   -0.221178   -1.037722    0.030740    0.357765
D    0.754534   -0.955277   -0.043329   -0.401912   -0.423262    0.452582

axis=1(열)을 기준으로 정렬합니다.

In [17]:
df

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-06  0.407420  0.588710  0.357765  0.452582

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.754534  1.734050  0.422313  0.474261
2013-01-02 -0.955277 -0.477239  0.383935  0.723571
2013-01-03 -0.043329 -0.221178 -1.238830 -0.132644
2013-01-04 -0.401912 -1.037722 -2.490431 -0.818340
2013-01-05 -0.423262  0.030740 -1.110036  0.341236
2013-01-06  0.452582  0.357765  0.588710  0.407420

values를 기준으로 정렬합니다.

기본적으로 오름차순이 적용됩니다. ascending = True

In [19]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-05  0.341236 -1.110036  0.030740 -0.423262
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-06  0.407420  0.588710  0.357765  0.452582

# 가져오기

single column을 선택하면 Series 가 생성이 됩니다.

df.A와 기능이 동등합니다.

In [22]:
df["A"]

2013-01-01    0.474261
2013-01-02    0.723571
2013-01-03   -0.132644
2013-01-04   -0.818340
2013-01-05    0.341236
2013-01-06    0.407420
Freq: D, Name: A, dtype: float64

[]을 사용하면 행을 분할(슬라이싱) 합니다.

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.474261  0.422313  1.734050  0.754534
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329

In [24]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.723571  0.383935 -0.477239 -0.955277
2013-01-03 -0.132644 -1.238830 -0.221178 -0.043329
2013-01-04 -0.818340 -2.490431 -1.037722 -0.401912

# 레이블별 선택

레이블을 사용하여 가져오기

In [30]:
df.loc[dates[0]]

A    0.474261
B    0.422313
C    1.734050
D    0.754534
Name: 2013-01-01 00:00:00, dtype: float64

컬럼을 다중으로 선택하여 가져오기

In [31]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.474261  0.422313
2013-01-02  0.723571  0.383935
2013-01-03 -0.132644 -1.238830
2013-01-04 -0.818340 -2.490431
2013-01-05  0.341236 -1.110036
2013-01-06  0.407420  0.588710

종료지점을 포함한 슬라이싱

In [32]:
df.loc["20130102" : "20130104", ["A","B"]]

                   A         B
2013-01-02  0.723571  0.383935
2013-01-03 -0.132644 -1.238830
2013-01-04 -0.818340 -2.490431

객체가 반환하는 차원이 감소합니다.

In [35]:
df.loc["20130102", ["A","B"]]

A    0.723571
B    0.383935
Name: 2013-01-02 00:00:00, dtype: float64

scalar 값을 가져옵니다

In [37]:
df.loc[dates[0], "A"]

0.47426110189934273

scalar에 빠르게 엑세스하여 가져오는 방법입니다.

In [42]:
# df.at["20130101","A"]
df.at[dates[0],"A"]

0.47426110189934273